cmsis-svd/cmsis-svd/data/Atmel/ATSAM3U4E.svd
        <register>
          <name>EPTCTL3_ISOENDPT</name>
          <description>UDPHS Endpoint Control Register (endpoint = 3)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EPT_ENABL</name>
              <description>Endpoint Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTO_VALID</name>
              <description>Packet Auto-Valid Enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTDIS_DMA</name>
              <description>Interrupt Disables DMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAX_RX</name>
              <description>DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDATA_RX</name>
              <description>MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error Interrupt Enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Interrupt Enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Interrupt Enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY_TRER</name>
              <description>TX Packet Ready/Transaction Error Interrupt Enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FL_ISO</name>
              <description>Error Flow Interrupt Enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_NTR</name>
              <description>ISO CRC Error/Number of Transaction Error Interrupt Enabled</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FLUSH</name>
              <description>Bank Flush Error Interrupt Enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY_BANK</name>
              <description>Busy Bank Interrupt Enabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet Interrupt Enabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSETSTA3</name>
          <description>UDPHS Endpoint Set Status Register (endpoint = 3)</description>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRCESTALL</name>
              <description>Stall Handshake Request Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>KILL Bank Set (for IN Endpoint)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>TX Packet Ready Set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSETSTA3_ISOENDPT</name>
          <description>UDPHS Endpoint Set Status Register (endpoint = 3)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXRDY_TXKL</name>
              <description>KILL Bank Set (for IN Endpoint)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXRDY_TRER</name>
              <description>TX Packet Ready Set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCLRSTA3</name>
          <description>UDPHS Endpoint Clear Status Register (endpoint = 3)</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRCESTALL</name>
              <description>Stall Handshake Request Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOGGLESQ</name>
              <description>Data Toggle Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_SETUP</name>
              <description>Received SETUP Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALL_SNT</name>
              <description>Stall Sent Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_IN</name>
              <description>NAKIN Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_OUT</name>
              <description>NAKOUT Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCLRSTA3_ISOENDPT</name>
          <description>UDPHS Endpoint Clear Status Register (endpoint = 3)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TOGGLESQ</name>
              <description>Data Toggle Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_FL_ISO</name>
              <description>Error Flow Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_CRC_NTR</name>
              <description>Number of Transaction Error Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_FLUSH</name>
              <description>Bank Flush Error Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSTA3</name>
          <description>UDPHS Endpoint Status Register (endpoint = 3)</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FRCESTALL</name>
              <description>Stall Handshake Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOGGLESQ_STA</name>
              <description>Toggle Sequencing</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>DATA0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>DATA1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Reserved for High Bandwidth Isochronous Endpoint</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>Reserved for High Bandwidth Isochronous Endpoint</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data/KILL Bank</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>TX Packet Ready</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_SETUP</name>
              <description>Received SETUP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL_SNT</name>
              <description>Stall Sent</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAK_IN</name>
              <description>NAK IN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAK_OUT</name>
              <description>NAK OUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK_CTLDIR</name>
              <description>Current Bank/Control Direction</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY_BANK_STA</name>
              <description>Busy Bank Number</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1BUSYBANK</name>
                  <description>1 busy bank</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BUSYBANKS</name>
                  <description>2 busy banks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3BUSYBANKS</name>
                  <description>3 busy banks</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYTE_COUNT</name>
              <description>UDPHS Byte Count</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSTA3_ISOENDPT</name>
          <description>UDPHS Endpoint Status Register (endpoint = 3)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>TOGGLESQ_STA</name>
              <description>Toggle Sequencing</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>DATA0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>DATA1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Data2 (only for High Bandwidth Isochronous Endpoint)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>MData (only for High Bandwidth Isochronous Endpoint)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data/KILL Bank</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY_TRER</name>
              <description>TX Packet Ready/Transaction Error</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FL_ISO</name>
              <description>Error Flow</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_NTR</name>
              <description>CRC ISO Error/Number of Transaction Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FLUSH</name>
              <description>Bank Flush Error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK0</name>
                  <description>Bank 0 (or single bank)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK1</name>
                  <description>Bank 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2</name>
                  <description>Bank 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY_BANK_STA</name>
              <description>Busy Bank Number</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1BUSYBANK</name>
                  <description>1 busy bank</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BUSYBANKS</name>
                  <description>2 busy banks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3BUSYBANKS</name>
                  <description>3 busy banks</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYTE_COUNT</name>
              <description>UDPHS Byte Count</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
